In [5]:
%reload_ext sql

In [7]:
%sql sqlite:///sample1.db

'Connected: None@sample1.db'

In [11]:
%sql select * from class;

Done.

[('BA200', 'M-F9', 'SC110'),
 ('BD445', 'MWF3', 'SC213'),
 ('BF410', 'MWF8', 'SC213'),
 ('CS150', 'MWF3', 'EA304'),
 ('CS250', 'MWF12', 'EB210')]

In [13]:
%sql select * from dept, emp where dept.deptno = emp.dno;

Done.

[(2, '기획', 10, 4377, '이성래', '사장', None, 5000000, 2),
 (1, '영업', 8, 3426, '박영권', '과장', 4377, 3000000, 1),
 (3, '개발', 9, 3011, '이수민', '부장', 4377, 4000000, 3),
 (3, '개발', 9, 3427, '최종철', '사원', 3011, 1500000, 3),
 (2, '기획', 10, 1003, '조민희', '과장', 4377, 3000000, 2),
 (2, '기획', 10, 2106, '김창섭', '대리', 1003, 2500000, 2),
 (1, '영업', 8, 1365, '김상원', '사원', 3426, 1500000, 1)]

In [15]:
%sql select * from emp;

Done.

[(4377, '이성래', '사장', None, 5000000, 2),
 (3426, '박영권', '과장', 4377, 3000000, 1),
 (3011, '이수민', '부장', 4377, 4000000, 3),
 (3427, '최종철', '사원', 3011, 1500000, 3),
 (1003, '조민희', '과장', 4377, 3000000, 2),
 (2106, '김창섭', '대리', 1003, 2500000, 2),
 (1365, '김상원', '사원', 3426, 1500000, 1)]

In [16]:
%%sql
select * from dept, emp
where dept.deptno = emp.dno;

Done.

[(2, '기획', 10, 4377, '이성래', '사장', None, 5000000, 2),
 (1, '영업', 8, 3426, '박영권', '과장', 4377, 3000000, 1),
 (3, '개발', 9, 3011, '이수민', '부장', 4377, 4000000, 3),
 (3, '개발', 9, 3427, '최종철', '사원', 3011, 1500000, 3),
 (2, '기획', 10, 1003, '조민희', '과장', 4377, 3000000, 2),
 (2, '기획', 10, 2106, '김창섭', '대리', 1003, 2500000, 2),
 (1, '영업', 8, 1365, '김상원', '사원', 3426, 1500000, 1)]